/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine ei voinut suorittaa varmuuskopiointia.";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Avaa Time Machine -asetukset…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "Tämän tietokoneen Time Machine -asetukset ovat hallittuja asetuksia. Ota yhteyttä järjestelmän ylläpitäjään.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "Ei virhettä.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Time Machinea ei voitu avata.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Varmuuskopiointia ei voitu suorittaa. Luotaessa varmuuskopiokansiota tapahtui virhe."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "Varmuuskopiolevy ei ole vaaditussa Mac OS laajennettu (kirjaava) -muodossa.\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse toinen varmuuskopiolevy.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Varmuuskopiolevyn tilaa ei voitu selvittää."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "Varmuuskopiolevyllä ei ole omistajuus käytössä. Omistajuuden on oltava käytössä, jotta tätä levyä voidaan käyttää Time Machine -varmuuskopiointiin.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse toinen varmuuskopiolevy.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "Varmuuskopiolevy ei ole vaaditussa Mac OS laajennettu (kirjaava) -muodossa.\n\n%@";
RESULTCODE_6_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse toinen varmuuskopiolevy."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "Varmuuskopio on liian suuri varmuuskopiolevylle. Varmuuskopiointi vaatii %@ tilaa, mutta käytettävissä on vain %@.\n\n%@";
RESULTCODE_7_SHOWPREFS = "Time Machine tarvitsee työskentelytilaa varmuuskopiolevyllä varmuuskopioiden tallentamiseen tarvittavan tilan lisäksi. Avaa Time Machine -asetukset ja valitse suurempi varmuuskopiolevy tai tee varmuuskopiosta pienempi sulkemalla pois tiedostoja."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Tiedostoja ei voida kopioida varmuuskopiolevylle, koska se on kirjoitussuojattu.\n\n%@";
RESULTCODE_8_SHOWPREFS = "Sinun täytyy ehkä korjata tai alustaa levy uudelleen Levytyökalulla. Jos levyä ei voida korjata, sinun täytyy käyttää toista levyä varmuuskopiointiin. Valitse toinen varmuuskopiolevy avaamalla Time Machinen asetukset."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "Varmuuskopiolevyllä ei ole vaaditut pääsynhallintaluettelot käytössä.\n\n%@";
RESULTCODE_9_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse toinen varmuuskopiolevy."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "Valmisteltaessa varmuuskopiota tapahtui virhe."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "Varmuuskopiointia ei voitu suorittaa, koska kopioitaessa tiedostoja varmuuskopiolevylle tapahtui virhe.";
RESULTCODE_11_MESSAGE = "Ongelma saattaa olla väliaikainen. Yritä varmuuskopiointia myöhemmin uudelleen. Jos ongelma jatkuu, korjaa varmuuskopiolevy Levytyökalulla.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "Linkitettäessä varmuuskopiolevyllä olevia tiedostoja tapahtui virhe."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "Liian monta tiedostoa muuttui varmuuskopioitaessa."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "Poistettaessa vanhentuneita varmuuskopioita varmuuskopiolevyltä tapahtui virhe.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "Kaikki vanhentuneet varmuuskopiot on poistettu, mutta varmuuskopiolevy on silti täynnä.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse suurempi varmuuskopiolevy.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "Kaikki vanhentuneet varmuuskopiot on poistettu, mutta varmuuskopiolevy on silti täynnä.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse suurempi varmuuskopiolevy."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "Varmuuskopiolevyä ei ole valittu.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse varmuuskopiolevy.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "Varmuuskopiolevyä ei löytynyt.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Varmista, että varmuuskopiolevy on liitetty, tai avaa Time Machine -asetukset ja valitse toinen varmuuskopiolevy."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "Varmuuskopiolevy ei ole käytettävissä."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "Varmuuskopiolevytiedostoa ”%@” ei voitu luoda (virhe %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "Varmuuskopiolevytiedostoa ”%@” ei voitu käyttää (virhe %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Varmuuskopiointi peruttiin."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "Varmuuskopioitava levy on isot ja pienet kirjaimet erotteleva, mutta varmuuskopiolevy ei ole.\n\n%@";
RESULTCODE_23_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse toinen varmuuskopiolevy tai älä varmuukopioi isot ja pienet kirjaimet erottelevaa levyä."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "Kahdella varmuuskopioitavalla levyllä on sama nimi. Nimeä toinen niistä uudelleen."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "Yhtään varmuuskopioitavia levyjä ei löytynyt. Näin voi tapahtua, jos kaikki levyt ovat Älä varmuuskopioi -luettelossa.\n\n%@";
RESULTCODE_25_SHOWPREFS = "Jos haluat muokata luetteloa, avaa Time Machine -asetukset ja osoita Valinnat.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "Time Machine ei voinut suorittaa varmuuskopiointia verkkovirheen vuoksi.";
RESULTCODE_26_MESSAGE = "Varmista, että tietokone ja varmuuskopiolevy ovat samassa verkossa ja että varmuuskopiolevy on päällä. Yritä varmuuskopiointia sitten uudelleen.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "Varmuuskopiolevy on ehkä poistettu näkyvistä tai irrotettu tietokoneesta.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "Varmuuskopiolevyn tila loppui yllättäen. Time Machine yrittää vapauttaa tilaa poistamalla vanhentuneita varmuuskopioita seuraavan varmuuskopioinnin aikana.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Avaa Time Machine -asetukset ja valitse suurempi varmuuskopiolevy tai tee varmuuskopiosta pienempi sulkemalla pois tiedostoja."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "Verkkovarmuuskopiolevyä ei voitu käyttää, koska verkon käyttäjätunnuksen tai salasanan kanssa on ongelma.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Avaa Time Machine -asetukset, valitse verkkovarmuuskopiolevy ja syötä käyttäjätunnus ja salasana uudelleen.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "Käytettäessä varmuuskopiota ”%@” uudelleen tapahtui virhe.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "Varmuuskopiolevytiedosto ”%@” on jo käytössä.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "Varmuuskopiolevytiedostoa ”%@” ei löytynyt.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "Järjestelmän päivämäärä ja aika on virheellinen.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "Tietokoneella ei ole ensisijaista verkkoliitäntää.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine ei löytänyt joitakin asetuksiaan.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Jos haluat tehdä Time Machine -asetukset uudelleen, avaa Time Machine -asetukset ja valitse varmuuskopiolevy uudelleen.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine ei löytänyt joitakin asetuksiaan varmuuskopiolevyltä ”%@”.\n\nVarmista, että varmuuskopiolevy on liitetty ja että muut liitetyt levyt eivät käytä samaa nimeä kuin varmuuskopiolevy.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Jos haluat tehdä Time Machine -asetukset uudelleen, avaa Time Machine -asetukset ja valitse varmuuskopiolevy uudelleen.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "Jokin varmuuskopioitavista levyistä on ehkä poistettu näkyvistä tai irrotettu tietokoneesta.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "Time Machine ei voi käyttää levytiedostoa, koska sille ei voida kirjoittaa.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "Time Machine ei voinut tarkistaa varmuuskopioita, koska varmuuskopiolevy ei ole käytettävissä.";
RESULTCODE_40_MESSAGE = "Varmista, että tietokone ja varmuuskopiolevy ovat samassa verkossa ja että varmuuskopiolevy on päällä. Yritä tarkistaa varmuuskopiot sitten uudelleen.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine ei voinut tarkistaa varmuuskopioita.";
RESULTCODE_41_MESSAGE = "Varmuuskopiolevy on kirjoitussuojattu.";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "Time Machine ei voinut tarkistaa varmuuskopioita, koska tarkistaminen keskeytettiin.";
RESULTCODE_42_MESSAGE = "Katkokset johtuvat yleensä verkko-ongelmista. Yritä uudelleen, kun verkko-ongelmat on ratkaistu.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine ei voinut siirtää syrjään olemassa olevaa varmuuskopiolevytiedostoa ”%@”";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine ei voinut poistaa varmuuskopiolevytiedostoa ”%@”";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Virhekoodi: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "Varmuuskopiolevy on lähes täynnä.";
RESULTCODE_1000_MESSAGE = "Kun varmuuskopiolevy on täynnä, Time Machine tekee tilaa uusille varmuuskopioille poistamalla vanhoja.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "Jos haluat säilyttää kaikki vanhat varmuuskopiot, avaa Time Machine -asetukset ja valitse uusi varmuuskopiolevy.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "Varmuuskopiolevy on täynnä.";
RESULTCODE_1001_MESSAGE = "Time Machine teki tilaa uusille varmuuskopioille poistamalla yhden tai useamman vanhan varmuuskopion. Vanhin jäljellä oleva varmuuskopio on: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "Jotta lisää vanhoja varmuuskopioita ei poisteta, avaa Time Machine -asetukset ja valitse toinen varmuuskopiolevy."; 
RESULTCODE_1001_CHECKBOX = "Älä näytä tätä varoitusta enää.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine ei ole varmuuskopioinut tietokonetta %@ päivään.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Varmista, että varmuuskopiolevy on käytettävissä, tai avaa Time Machine -asetukset ja valitse uusi varmuuskopiolevy.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Haluatko käyttää varmuuskopiota ”%@” uudelleen tämän tietokoneen kanssa?";
RESULTCODE_1003_MESSAGE = "Varmuuskopio on luotu toisella tietokoneella. Jos käytät tätä varmuuskopiota uudelleen, alkuperäinen tietokone ei voi enää käyttää sitä.";
REUSE_BACKUP_BUTTON = "Käytä varmuuskopiota uudelleen";
CREATE_NEW_BACKUP_BUTTON = "Luo uusi varmuuskopio";
ASK_LATER_BUTTON = "Älä varmuuskopioi nyt";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "Kohteelle ”%@” on saatavilla päivitys.";
RESULTCODE_1004_MESSAGE = "Tämä päivitys parantaa Time Capsulen luotettavuutta. Asenna päivitys avaamalla AirPort-työkalu. Syötä tarvittaessa Time Capsule -salasana kohteelle ”%@”.";
REMIND_LATER_BUTTON = "Päivitä myöhemmin";
AIRPORT_UTILITY_BUTTON = "Avaa AirPort-työkalu…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine suoritti varmuuskopioittesi tarkistuksen loppuun. Luotettavuuden parantamiseksi Time Machinen on luotava uusi varmuuskopio.";
RESULTCODE_1006_MESSAGE = "Luo uusi varmuuskopio osoittamalla Aloita uusi varmuuskopiointi. Tämä poistaa olemassa olevan varmuuskopiohistorian. Tämä saattaa kestää useita tunteja.\n\nOsoittamalla Varmuuskopioi myöhemmin sinua muistutetaan asiasta huomenna. Time Machine ei suorita varmuuskopiointia tällä välin.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Aloita uusi varmuuskopiointi";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Varmuuskopioi myöhemmin";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "Varmuuskopiolevyn tunniste on muuttunut edellisen varmuuskopioinnin jälkeen.";
RESULTCODE_1008_MESSAGE = "Levy on ehkä korvattu tai tyhjennetty tai joku yrittää huijata tietokonettasi varmuuskopioimaan väärälle levylle.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Käytä tätä levyä";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Älä varmuuskopioi nyt";

// UNITS
KB = "Kt";
MB = "Mt";
GB = "Gt";
TB = "Tt";
